<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Теория</title>
<link rel="stylesheet" href="theory.css">
<script src="https://code.jquery.com/jquery-1.12.4.js"></script>
</head>
<body>
<div class="sideNav">
	<div class="navFill">
		  <a href="javascript:void(0)" class="closebtn" onclick="closeNav()">&times;</a>
		  <a class="anchor" href="#ar1">Введение</a>
		  <a class="anchor" href="#ar2">Нотное письмо</a>
		  <a class="anchor" href="#ar3">Ритм и метр</a>
		  <a class="anchor" href="#ar4">Интервалы</a>
		  <a class="anchor" href="#ar5">Лад и тональность</a>
		  <a class="anchor" href="#ar6">Аккорды</a>
	</div>
</div>
<div class="midBlock">
	<div class="header">
					<div class="button" id="button1"><div class="headerButton"><a href="/theory">Теория</a><div class="borderButton"><div class="borderLine" id="line1"></div></div></div></div>
					<div class="button" id="button2"><div class="headerButton"><a href="/practice">Практика</a><div class="borderButton"><div class="borderLine" id="line2"></div></div></div></div>
					<div class="button" id="button3"><div class="headerButton"><a href="/pmaster">Онлайн-пианино</a><div class="borderButton"><div class="borderLine" id="line3"></div></div></div></div>
					<div class="button" id="button4"><div class="headerButton">Информация<div class="borderButton"><div class="borderLine" id="line4"></div></div></div></div>
					<a class="logo" href="/"></a>
					<span onclick="openNav()" class="open">Разделы   &#9776;</span>
				</div>
	<div class="articleHolder">
		<div class="article" id="ar1">
			<div class="title">Введение в основы</div>
			<p>Музыкальная система, положенная в основу современной музыкальной практики, представляет собой ряд звуков, находящихся между собой в опеределенный высотных взаимоотношениях.Расположение звуков по высоте называется <b>звукорядом</b>, а каждый звук - его <b>ступенью.</b> Основным ступеням звукоряда музыкальной системы присвоено семь самостоятельных названий: </p>
				<div class="ex"> До, Ре, Ми, Фа, Соль, Ля, Си <br>
				C, D, E, F, G, A, B <br>
				</div>
			<p>Каждый восьмой звук (считая вверрх по белым клавишам) повторяет себя с удвоенным количеством колебаний, поэтому ступени звукоряда повторяются. Расстояние между звуками одинаковых ступеней называется <b> октавой </b>. Октавой также называется часть звукоряда, в кторую входит 7 основных ступеней. Началом октавы принято считать звук ступени До. весь звукоряд состоит из семи полных октав и четырех звуков, образующих неполные октавы.</p>
			<div class="ex"> <img src="img/1.jpg" alt=""></div>
			<p>Каждая октава делится на 12 полутонов.Полутон является самым узким расстоянием между звуками музыкальной системы. Расстояние, образованное двумя полутонами, называется <b>целым тоном</b>. Между основными ступенями звукоряда имеются два полутона и 5 целых тонов:</p>
			<div class="ex"><img src="img/2.jpg" alt=""></div>
			<p>Каждая основная ступень звукоряда может быть повышена или понижена. Звуки, с повышенными или пониженными ступенями, считаются <b> производными</b>. Повышение ступеней на полтона обозначается знаком <b> диез(#)</b>, а понижение - <b>бемоль(♭)</b>. Также существует повышение на два полутона - дубль диез(×) и понижение на два полутона - дубль бемоль(♭♭). Для отмены повышения или понижения существует <b>бекар(♮)</b></p>
		<p>Описанное повышение и понижение основных ступеней называется <b>альтерацией</b>. </p>
			<p>Для обозначения производных ступеней к буквам прибавляются слоги: is - диез, isis - дубль-диез, es - бемоль, eses - дубль-бемоль. Например:</p>
			<div class="ex">cis - до-диез, fisis - фа-дубль-диез, <br>
				des - ре-бемоль, geses - соль-дубль-бемоль.
			</div>
			<p>Исключение составляет производная ступень си-бемоль, за которой сохраняется обозначение буквой <i>B</i>, <i>b</i>.
			</p>
			<p>При гласных <i>a</i> и <i>e</i> в слоге <i>es</i> буква <i>e</i>, для удобства отбрасывается; получается:</p>
			<div class="ex">ми-бемоль не <i>ees</i>, a <i>es</i>; <br>
				ля-бемоль не <i>aes</i>, a <i>as</i>.
			</div>
		</div>
		<div class="article" id="ar2">
			<div class="title">Нотное письмо</div>
			<p> 
				Нотным письмом называется исторически установившаяся система записи звуков особыми знаками - <b> нотами</b>. Нотный знак представляет собой кружок пустой или затушеванный. </p>
				<p>Для обозначения различных длительностей звуков к кружкам прибавляются палочки (штили), хвосты и ребра - прямые горизонтальные линии для связывания коротких длительностей в группы. </p>
				<p>Для определения высоты звука ноты размещаются на <b>нотном стане</b>, состоящем из 5 параллельных линий, представляющих вместе одну нотную строку. Ноты пишутся на нотном стане - на линиях и между линиями, то есть в промежутках:</p>
				<div class="ex"> <img src="img/3.jpg" alt=""></div>
			<p>Таблица длительностей:</p>
			<div class="ex"><img src="img/4.jpg" alt=""></div>
			<p>Кроме основных линий применяются короткие, добавочные линии для отдельных нот. Они пишутся под нотным станом и над ним. Например:</p>
			<div class="ex"><img src="img/5.jpg" alt=""></div>
			<p>Палочки (штили) ставятся на нотном стане у кружков (головок) нот: справа - вверх от второго промежутка и ниже; слева - вниз от третьей линии и ниже. Например:</p>
			<div class="ex"><img src="img/6.jpg" alt=""></div>
			<p>За линиями и промежутками  нотного стана закрепляется определенная высота звуков посредством знака, который называется <b>ключом</b>. Ключ ставится в начале нотного стана на одну из основных линий так, чтобы она пересекала его в центре. В настоящее время употребляются три различных ключа: скрипичный ключ(ключ соль), басовый ключ (ключ фа), альтовый и теноровый (используются для отдельных музыкальных инструментов)</p>
			<div class="ex"><img src="img/7.jpg" alt=""></div>
			<p>Что касается знаков альтерации, они ставятся перед нотами по мере надобности, а также при ключе справа от него на линиях и в промежутках:</p>
			<div class="ex"><img src="img/8.jpg" alt=""></div>
			<p>Знаки альтерации, вставляемые при ключе называются ключевыми и действительны на протяжении всего музыкального произведения для всех октав. Случайные знаки действительны только на один такт(ячейку нотной строки) и лишь для звука, перед которым они стоят.</p>
			<p>Кроме основных длительностей, существуют знаки увеличивающие длительность.</p>
			<p>К ним относятся: <br> <b>Точка</b> - увеличивает длительнусть на ее половину; она ставится справа у головки ноты:</p>
			<div class="ex"><img src="img/9.jpg" alt=""></div>
			<p><b>Лига</b> - вогнутая линия, связывающая стоящие рядом нотные длительности одинаковой высоты</p>
			<div class="ex"><img src="img/10.jpg" alt=""></div>
			<p><b>Фермата</b> - знак обозначающий не ограниченное временем увеличение длительности, ставится над нотой или под нотой</p>
			<div class="ex"><img src="img/11.jpg" alt=""></div>
			<p>Перерыв в звуччании называется <b>паузой</b>. Продолжительность пауз измеряется такими же длительностями как и звуки:</p>
			<div class="ex"><img src="img/12.jpg" alt=""></div>
		</div>
		<div class="article" id="ar3">
			<div class="title">Ритм и метр</div>
			<p><b>Ритмом</b> называется соотношение длительностей звуков в их последовательности</p>
			<p>В музыке звуки организованы во времени. Чередование звуков равными по времени долями образует в музыке равномерное движение. В этом движении звуки некоторых долей называются <b>акцентами</b>. </p>
			<p>Доли, на которые приходятся акценты называются <b>сильными долями</b>.</p>
			<p>Равномерное чередование сильных и слабых долей называется <b>метром</b></p>
			<p>Доля метра может быть выражена различной длительностью. Выражение долей метра определенной длительстью называется <b>размером</b>.</p>
			<p>В нотном письме размеры обозначаются двумя цифрами, расположенными после знаков альтерации одна под другой. Например:</p>
			<div class="ex"><img src="img/13.jpg" alt=""></div>
			<p>Верхняя цифра обозначает количество метрических долей, а нижняя - какой длительностью выражена доля метра в данном размере. </p>
			<p>Отрезок произведения от одной сильной доли до следующей называется <b>тактом</b>.</p>
			<p>В нотной записи такты отделены друг от друга вертикальной чертой перпендикулярно нотному стану. Эта черта называется <b>тактовой чертой</b>. Тактовая черта ставится перед сильной долей, чтобы ее выделить.</p>
			<p>Размер <i>"2/4"</i> читают как <i>"размер две четверти"</i>, что означает, что в каждом такте сумарная длительность нот равна двум четвертным.</p>
			<p>Если музыка начинается со слабой доли, то вначале образуется неполный такт, который называется <b>затактом</b>. В большинстве случаев затакт не превышает половины такта. В большинстве случаев, также, произведение, начавшееся с затакта, заканчивается знеполным тактом, дополняющим затакт</p>
			<p>В конце, а иногда и по окончании части произведения ставится <b>двойная тактовая черта</b>.</p>
			<p>Чтобы не сбиться, вы можете дирижировать размер произведения. Под дирижированием подразумевается средство: во-первых, счета, то есть указания времени продолжительности и смены долей такта; во-вторых, установление темпа для данного произведения. В основу дирижирования положены двухдольные, трехдольные и четырехдольные фигуры взмахов.</p>
			<p><b>Двухдольные (размер две четверти)</b></p>
			<div class="ex"><img src="img/14.jpg" alt=""></div>
			<p><b>Трехдольные (размер три четверти)</b></p>
			<div class="ex"><img src="img/15.jpg" alt=""></div>
			<p><b>Четырехольные (размер четыре четверти)</b></p>
			<div class="ex"><img src="img/16.jpg" alt=""></div>
		</div>
		<div class="article" id="ar4">
			<div class="title">Интервалы</div>
			<p>Одновременное или последовательное сочетание двух звуков называтся <b>интервалом</b></p>
			<p>Звуки интервала, взятые последовательно, образуют мелодический интервал. Звуки интервала, взятые одновременно, образуют гармонический интервал.</p>
			<p>Нижний звук интервала называется основанием интервала, а верхний - вершиной интервала.</p>
			<p>Название интервала обуславливается количеством ступеней и нот, которые он охватывает. Между основными ступенями звукоряда (в пределах октавы) образуются следующие интервалы:</p>
			<div class="ex"><img src="img/17.jpg" alt=""></div>
			<p>Например:</p>
			<div class="ex"><img src="img/18.jpg" alt=""></div>
			<p><i>Интервалы являются основой мелодии. От сочетания мелодических интервалов  в различной последовательности мелодическое движение приобретает многобразную выразительность</i></p>
			<p>Перемещение звуков интервала, благодаря которому нижний звук становится верхним, а верхний звук - нижним, называется <b>обращением интервала</b></p>
			<p>Возможны два способа перемещения звуков, а именно:</p>
			<p>1. Перенесение основания интервала (нижнего звука) на октаву вверх.</p>
			<p>2. Перенесение вершины интервала (верхнего звука) на октаву вниз.</p>
			<p>В результате этого получается новый интервал. Как правильно чистые интервалы обращаются в чистые, малые - в большие, большие - в малые.</p>
			<div class="ex"><img src="img/19.jpg" alt=""></div>
		</div>
		<div class="article" id="ar5">
			<div class="title">Лад и тональность</div>
			<p>Слушая или исполняя музыкальное произведение, мы наблюдаем, что образующие его щвуки находятся между собой в определенном соотношении. Это выражается прежде всего в том, что в процессе развития музыки, в частности мелодии, некоторые звуки, выделяясь из общей массы, приобретают характер <i>опорных</i> звуков. Мелодия обычно и заканчивается на одном из этих звуков.</p>
			<p>Опорные звуки принято называть <b>устойчивыми</b> звуками. Такое определение опорных звуков соответствует их характеру, так как окончание мелодии на опорном звуке производит впечатление устойчивости, покоя.</p>
			<p>Один из устойчивых звуков обычно выделяется больше, чем другие. Он является как бы главной опорой. Такой устойчивый звук называется <b>тоникой</b></p>
			<p>В противоположность устойчивым, другие звуки называются <b>неустойчивыми</b>.</p>
			<p>Переход неустойчивого звука в  устойчивый называется <b>разрешением</b>.</p>
			<p>Система взаимоотношения между устойчивыми и неустойчивыми звуками называется <b>ладом</b>.</p>
			<p><b>Мажорным</b> называется лад, устойчивые звуки которого образуют <b>большое или мажорное трезвучие</b> - аккорд, состоящий из трех звуков. Звуки мажорного трезвучия расположены по терциям: большая терция + малая терция. </p>
			<p>Мажорное трезвучие, построенное на тонике, называется <b>тоническим трезвучием</b></p>
			<p>Расположение звуков лада в порядке высоты (от тоники до тоники следующей октавы) называется звукорядом лада или <b>гаммой</b>.</p>
			<p>Звуки, образующие гамму называются ступенями</p>
			<p>В гамме мажорного лада семь ступеней. Ступени обозначают римскими цифрами. Ступени мажорной гаммы образуют следующую последовательность секунд:</p>
			<div class="ex">б2, б2, м2, б2, б2, б2 ,м2</div>
			<div class="ex"><img src="img/20.jpg" alt=""></div>
			<p>Натуральный мажорный лад может быть построен от любой ступени музыкального звукоряда. Высота, на которой расположен лад, называется тональностью. Название тональности происходит от названия звука принятого за тонику. Название тональности составляется из обозначения тоники и лада(в данном случае мажор). Например:</p>
			<div class="ex"> <i>До мажор</i> или <i>C-dur</i>; <br>
				<i>Соль мажор</i> или <i>G-dur</i> и т. д.
			</div>
			<p>Тональность До мажор, рассмотреная выше содержит в себе все основные ступени, однако тональности, образованные от других ступеней, содержат в себе производные ступени. Некоторые содержат только пониженные ступени - <b>бемольные тональности</b>, некоторые - только повышенные - <b>диезные тональности</b> </p>
			<p>Тональности, отличающиеся друг от друга одним ключевым знаком, являются родственными, ввиду того, что в их составе шесть общих звуков.</p>
			<p>Порядок расположения диезных тональностей идет по чистым квинтам вверх. С каждой квинтой добавляется диез. Диез ставится на ступени тоники предыдущей тональности: </p>
			<div class="ex"><img src="img/21.jpg" alt=""></div>
			<p>Порядок расположения бемольных мажорных тональностей на основе родства возникает таким же путем, но тольок вниз по чистым квинтам.</p>
			<div class="ex"><img src="img/22.jpg" alt=""></div>
			<p>Ключевые знаки энгармонически равных тональностей в сумме составляют 12 знаков. Порядок расположения мажорных тональностей: диезных вверх по чистым квинтам, а бемольных вниз - называют <b>квинтовым кругом</b></p>
			<div class="ex"><img src="img/23.jpg" alt=""></div>
			<p><b>Минорным</b> называется лад, устойчивые звуки которого образуют <b>малое или минорное трезвучие</b> - аккорд образованный малой терцие + большой терцией.</p>
			<p>Порядок последовательности секунд в гамме натурального минора следующий:</p>
			<div class="ex"> б2, м2, б2, б2, м2, б2, б2</div>
			<p>Ступени гаммы натурального минора имеют такие же цифровые обозначения и названия как и в миноре:</p>
			<div class="ex"><img src="img/24.jpg" alt=""></div>
			<p>Диезные минорные тональности</p>
			<div class="ex"><img src="img/25.jpg" alt=""></div>
			<p>Бемольные минорные тональности</p>
			<div class="ex"><img src="img/26.jpg" alt=""></div>
			<p>Квинтовый круг минорных тональностей</p>
			<div class="ex"><img src="img/27.jpg" alt=""></div>
		</div>
		<div class="article" id="ar6">
			<div class="title">Аккорды</div>
			<p><b>Аккордом</b> называется одновременное сочетание трех или более звуков, которые расположены по терциям или могут быть расположены по терциям.</p>
			<p>Аккорд строится от нижнего звука вверх. От того, какие терции входят в образование трезвучия и каков порядок их расположения, зависит вид трезвучия. Из больших и малых терций образуются четыре вида трезвучий:</p>
			<p><b>Мажорное</b> или большое трезвучие состоит из б3 + м3, между крайними звуками образуется ч5</p>
			<p><b>Минорное</b> или малое трезвучие состоит из м3 + б3, между крайними звуками образуется ч5</p>
			<p><b>Увеличенное</b> трезвучие состоит из б3 + б3, между крайними звуками образуется ув5 (м6)</p>
			<p><b>Уменьшенное</b> трезвучие состоит из м3 + м3, между крайними звуками образуется ум5</p>
			<div class="ex"><img src="img/28.jpg" alt=""></div>
			<p>Трезвучие имеет два обращения: первое обращение - <b>секстаккорд</b>, оно получается от переноса примы на октаву вверх, второе - <b>квартсекстаккорд</b>, оно получается от переноса примы и терции на октаву вверх.
			Секстаккорд обозначется цифрой 6, так как для этого аккорда характерна секста, образованная от нижнего звука к перенесенной приме. Квартсекстаккорд обозначается цифрами (6/4) по интервалас образовавшимися от нижнего звука.</p>
			<div class="ex"><img src="img/29.jpg" alt=""></div>
			<p>Мажорные и минорные секстаккорд и квартсексаккорд отличаются тем что, образованны обращением мажорного и минорного тонических трезвучий соответственно.</p>
			<p>Аккорд, состоящий из четырех звуков, расположенных по терциям, называется <b>септаккордом</b>. Крайние звуки образуют септиму, от этого и происходит название аккорда</p>
			<p>Наиболее распространенным септаккордом является <b>доминантсептаккорд</b>, который строится на V ступени. Он состоит из мажорного трезвучия с добавленной сверху малой терцией (б3 + м3 + м3). Доминантсептаккорд обозначается V7</p>
			<div class="ex"><img src="img/30.jpg" alt=""></div>
			<p>Доминантсептаккорд имеет три обращения:</p>
			<p>1-e обращение - <b>квинтсекстаккорд V(6/5)</b></p>
			<p>2-e обращение - <b>терцквартаккорд V(4/3)</b></p>
			<p>3-e обращение - <b>секундаккорд V(2)</b></p>
			<div class="ex"><img src="img/31.jpg" alt=""></div>
			<p>Доминантсептаккорд и его обращения являются диссонирующими аккордаим, поэтому требуют разрешения. Разрешения аккордов:</p>
			<div class="ex"><img src="img/32.jpg" alt=""></div>
		</div>
		<div class="footer">
			2018 qwerty.
		</div>
	</div>
</div>
	<script>
		l = $('.header').position().left + 1100 - $('.sideNav').width();
		$('.sideNav').css({left: l});
		var isNavOpen = 0;
		$(window).click(function(e){
			if(e.target.className!='navFill' && e.target.className!='sideNav' && e.target.className!='open'){
				closeNav();
			}
		});
		$('#button1').mouseover(function(){
			$('#line1').css('width','100%');
		});
		$('#button1').mouseout(function(){
			$('#line1').css('width','0%');
		});
		$('#button2').mouseover(function(){
			$('#line2').css('width','100%');
		});
		$('#button2').mouseout(function(){
			$('#line2').css('width','0%');
		});
		$('#button3').mouseover(function(){
			$('#line3').css('width','100%');
		});
		$('#button3').mouseout(function(){
			$('#line3').css('width','0%');
		});
		$('#button4').mouseover(function(){
			$('#line4').css('width','100%');
		});
		$('#button4').mouseout(function(){
			$('#line4').css('width','0%');
		});	
		function openNav() {
			$('.sideNav').height("400");
			l = $('.header').position().left + 1100 - $('.sideNav').width();
			$('.sideNav').css({left: l});
			isNavOpen = 1;
		}
		function closeNav() {
			$('.sideNav').height("0");
			isNavOpen = 0;
		}
		$(".anchor").click("a", function (event) {
			event.preventDefault();
			var id  = $(this).attr('href'), top = $(id).offset().top;
			$('body,html').animate({scrollTop: top}, 1000);
		});
	</script>

</body>
</html>
